export const CHANCE_CARDS = [
  {
    id: 1,
    title: 'Передача хода',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы передаете задание команде слева от вас. Если эта команда выполняет задание, вы вместе двигаетесь вперед по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 2,
    title: 'Передача хода',
    description: 'ВТБ поощряет стремление и усердие! Идите вперед на 4 клетки, если у вас есть 3+ любых навыка.',
  },
];

export const SKILL_CARDS = [
  {
    id: 1,
    title: 'Навык: Командная работа',
    description:
      'А ты знал, что у сотрудников ВТБ есть своя валюта?Если нет, то теперь ты стал немного ближе к команде ВТБ\n' +
      'ВТБшки - внутренняя валюта, которой награждаются сотрудники за выполнение показателей (можно приобретать брендированную продукцию).',
  },
];

export const TASK_CARDS = [];
