import { ReactComponent as AnswerSign1 } from '../assets/icons/answerSign1.svg';
import { ReactComponent as AnswerSign2 } from '../assets/icons/answerSign2.svg';
import { ReactComponent as AnswerSign3 } from '../assets/icons/answerSign3.svg';
import { ReactComponent as AnswerSign4 } from '../assets/icons/answerSign4.svg';
import TaskImage3 from '../assets/images/taskCardRandomizerBackground.png';
import TaskAudio7 from '../assets/audio/taskAudio7.mp3';

export const CHANCE_CARDS = [
  {
    id: 1,
    title: 'Передача хода',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы передаете задание команде слева от вас. Если эта команда выполняет задание, вы вместе двигаетесь вперед по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 2,
    title: 'Передача хода',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы передаете задание команде слева от вас. Если эта команда выполняет задание, вы вместе двигаетесь вперед по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 3,
    title: 'Передача хода',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы передаете задание команде слева от вас. Если эта команда выполняет задание, вы вместе двигаетесь вперед по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 4,
    title: 'Передача хода',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы передаете задание команде слева от вас. Если эта команда выполняет задание, вы вместе двигаетесь вперед по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 5,
    title: 'Передача хода',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы передаете задание команде слева от вас. Если эта команда выполняет задание, вы вместе двигаетесь вперед по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 6,
    title: 'Кросс-командное обучение',
    description:
      'Эту карточку можно использовать для обмена навыками с другими командами. \nВы  можете обменяться  с командой справа от вас. Так обе команды получат дополнительный навык.',
  },
  {
    id: 7,
    title: 'Кросс-командное обучение',
    description:
      'Эту карточку можно использовать для обмена навыками с другими командами. \nЕсли у вас есть карточка-дубль какого-либо навыка, вы можете поменяться с командой справа от вас, если у нее также есть карточка-дубль другого навыка',
  },
  {
    id: 8,
    title: 'Кросс-командное обучение',
    description:
      'Эту карточку можно использовать для обмена навыками с другими командами. \nЕсли у вас есть карточка-дубль какого-либо навыка, вы можете поменяться с командой справа от вас, если у нее также есть карточка-дубль другого навыка',
  },
  {
    id: 9,
    title: 'Кросс-командное обучение',
    description:
      'Эту карточку можно использовать для обмена навыками с другими командами. \nЕсли у вас есть карточка-дубль какого-либо навыка, вы можете поменяться с командой справа от вас, если у нее также есть карточка-дубль другого навыка',
  },
  {
    id: 10,
    title: 'Кросс-командное обучение',
    description:
      'Эту карточку можно использовать для обмена навыками с другими командами. \nЕсли у вас есть карточка-дубль какого-либо навыка, вы можете поменяться с командой справа от вас, если у нее также есть карточка-дубль другого навыка.',
  },
  {
    id: 11,
    title: 'Аукцион',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы выставляете задание на аукцион. Команда, которая первой выполнит задание, двигается вперед вместе с вами по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 12,
    title: 'Аукцион',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы выставляете задание на аукцион. Команда, которая первой выполнит задание, двигается вперед вместе с вами по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 13,
    title: 'Аукцион',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы выставляете задание на аукцион. Команда, которая первой выполнит задание, двигается вперед вместе с вами по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 14,
    title: 'Аукцион',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы выставляете задание на аукцион. Команда, которая первой выполнит задание, двигается вперед вместе с вами по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте.',
  },
  {
    id: 15,
    title: 'Аукцион',
    description:
      'Эту карточку можно использовать, когда попадается сложное задание. В этом случае вы выставляете задание на аукцион. Команда, которая первой выполнит задание, двигается вперед вместе с вами по игровому полю на то количество клеток, которое указано в задании. Если задание не выполнено, остаетесь на месте',
  },
  {
    id: 16,
    title: 'Продвижение',
    description: 'ВТБ поощряет стремление и усердие! Идите вперед на 4 клетки, если у вас есть 3+ любых навыка',
  },
  {
    id: 17,
    title: 'Продвижение',
    description: 'ВТБ поощряет стремление и усердие! Идите вперед на 4 клетки, если у вас есть 3+ любых навыка',
  },
  {
    id: 18,
    title: 'Удача не на твоей стороне',
    description:
      'Вы планировали посетить онлайн-лекцию по теме тайм-менеджмента, но в самом начале трансляции интернет отключился из-за неполадок на линии. \n\nПропустите ход.',
  },
  {
    id: 19,
    title: 'Повышение квалификации',
    description:
      'Пришло время пройти повышение квалификации. Если ответите на 3 вопроса, можете сразу перейти на следующую должность.\nНа каждый вопрос у вас есть 15 секунд .',
  },
  {
    id: 20,
    title: 'Продвижение',
    description: 'ВТБ поощряет стремление и усердие! Идите вперед на 4 клетки, если у вас есть 3+ любых навыка',
  },
  {
    id: 21,
    title: 'Продвижение',
    description: 'ВТБ поощряет стремление и усердие! Идите вперед на 4 клетки, если у вас есть 3+ любых навыка',
  },
  {
    id: 22,
    title: 'Удача не на твоей стороне',
    description:
      'Вы планировали посетить онлайн-лекцию по теме тайм-менеджмента, но в самом начале трансляции интернет отключился из-за неполадок на линии. \n\nПропустите ход.',
  },
  {
    id: 23,
    title: 'Повышение квалификации',
    description:
      'Пришло время пройти повышение квалификации. Если ответите на 3 вопроса, можете сразу перейти на следующую должность.\nНа каждый вопрос у вас есть 15 секунд .',
  },
  {
    id: 24,
    title: 'Продвижение',
    description: 'ВТБ поощряет стремление и усердие! Идите вперед на 4 клетки, если у вас есть 3+ любых навыка',
  },
  {
    id: 25,
    title: 'Удача не на твоей стороне',
    description:
      'Вы планировали посетить онлайн-лекцию по теме тайм-менеджмента, но в самом начале трансляции интернет отключился из-за неполадок на линии. \n\nПропустите ход.',
  },
  {
    id: 26,
    title: 'Повышение квалификации',
    description:
      'Пришло время пройти повышение квалификации. Если ответите на 3 вопроса, можете сразу перейти на следующую должность.\nНа каждый вопрос у вас есть 15 секунд .',
  },
];

export const SKILL_CARDS = [
  {
    id: 1,
    title: 'Навык: Командная работа',
    description:
      'А ты знал, что у сотрудников ВТБ есть своя валюта?\nЕсли нет, то теперь ты стал немного ближе к команде ВТБ\nВТБшки — внутренняя валюта, которой награждаются сотрудники за выполнение показателей (можно приобретать брендированную продукцию).',
  },
  {
    id: 2,
    title: 'Навык: Тайм-менеджмент',
    description:
      'Сообщение от наставника \n\nПривет, Стажёр! \nОтправляю ссылку на приложение, где ты найдешь свое расписание. \nПиши, если не разберешься с интерфейсом.',
  },
  {
    id: 3,
    title: 'Навык: Знаток Истории',
    description: 'В 2020 году банк занял первое место в рейтинге Forbes по числу клиентов-долларовых миллионеров',
  },
  {
    id: 4,
    title: 'Навык: Тайм-менеджмент',
    description:
      'Сообщение от наставника \n\nПривет, стажёр!\nОтправляю тебе расписание твоих задач на неделю! Ознакомься внимательно, до встречи в понедельник!',
  },
  {
    id: 5,
    title: 'Навык: Знаток банка',
    description:
      'Сообщение от наставника \n\nПривет, Стажёр! \nНапоминаю номера экстренной помощи\n \n112 — МЧС\n8 (800) 100-24-24 — ВТБ',
  },
  {
    id: 6,
    title: 'Навык: Кот Леопольд',
    description:
      'Первое правило оператора (работника):\n\nСпокойствие, только спокойствие!\nВыдержка важна в любой ситуации, даже если клиент так не думает.',
  },
  {
    id: 7,
    title: 'Навык: Знаток Истории',
    description:
      'А ты знал, что первый зарубежный банк был открыт в Анголе? Да-да, в той самой Африканской стране, находящейся аж на другом континенте! Произошло это 2 сентября 2006 года, а на церемонии присутствовал сам министр иностранных дел.',
  },
  {
    id: 8,
    title: 'Навык: Лучше, чем ПоверПоинт',
    description:
      'Умение правильно презентовать продукт и компанию крайне важно! Это не очень сложно, достаточно придерживаться пары несложных правил:\nВажно показать преимущества компании и продукта, которые основаны на пожеланиях клиента (выявленных потребностях).',
  },
  {
    id: 9,
    title: 'Навык: Юридическая подкова',
    description:
      'Сообщение от наставника\n\nПривет, Стажёр! \n\n Рады видеть тебя в наших рядах, не забудь завтра принести Паспорт, он понадобится для оформления зарплатной карты.',
  },
  {
    id: 10,
    title: 'Навык: Знаток банка',
    description:
      'Помни, если клиент обратился к тебе за помощью  по вопросам связанным с картой, то ты можешь запросить кодовое слово, но не пароли от карты или приложения, эта информация тебе ни к чему)',
  },
  {
    id: 11,
    title: 'Навык: Благотворительность',
    description:
      'ВТБ – это не только технологии, но и любовь к природе. Мы стараемся обеспечивать комфортную жизнь не только своим клиентам, но также заботимся о животных. Наши фонды помогают Амурским тиграм и зубрам.',
  },
  {
    id: 12,
    title: 'Навык: Юридическая подкова',
    description:
      'Привет, стажёр! Жду сканы твоих документов, чтобы подписать договор. \nНапоминаю, что договор ты подписываешь с ПАО "ВТБ"',
  },
];

export const TASK_CARDS = [
  {
    id: 1,
    number: 1,
    type: 'answers',
    answers: [
      { text: 'Паспорт, СНИЛС и ИНН', sign: AnswerSign1, correct: true },
      { text: 'Усы, лапы и хвост', sign: AnswerSign2, correct: false },
      { text: 'Паспорт, СНИЛС, свидетельство о рождении', sign: AnswerSign3, correct: false },
      { text: 'Паспорт, ИНН', sign: AnswerSign4, correct: false },
    ],
    columns: 2,
    title: 'Навык: Тайм-менеджмент',
    description: 'Назовите 3 предмета, без которых нельзя обойтись в офисе',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    timer: 30,
    answer: 'ПАО Публичное акционерное общество',
  },
  {
    id: 2,
    number: 2,
    type: 'list',
    items: ['Паспорт, СНИЛС и ИНН', 'Усы, лапы и хвост', 'Паспорт, СНИЛС, свидетельство о рождении', 'Паспорт, ИНН'],
    title: 'Навык: Тайм-менеджмент',
    description: 'Назовите 3 предмета, без которых нельзя обойтись в офисе',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    timer: 30,
    answer: 'ПАО Публичное акционерное общество',
    answerLink: 'https://www.vtb.ru/about/contacts/',
  },
  {
    id: 3,
    number: 3,
    type: 'image',
    image: TaskImage3,
    title: 'Навык: Тайм-менеджмент',
    description: 'Назовите 3 предмета, без которых нельзя обойтись в офисе',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    timer: 30,
    answer: 'ПАО Публичное акционерное общество',
    answerLink: 'https://www.vtb.ru/about/contacts/',
  },
  {
    id: 4,
    number: 4,
    type: 'list',
    items: ['Принтер'],
    columns: 2,
    description: 'Назовите 3 предмета, без которых нельзя обойтись в офисе',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    timer: 30,
    answer: 'ПАО Публичное акционерное общество',
    answerLink: 'https://www.vtb.ru/about/contacts/',
  },
  {
    id: 5,
    number: 5,
    type: 'list',
    items: ['А мы рубль девальвировали, девальвировали, да недодевальвировали…'],
    description: 'Назовите 3 предмета, без которых нельзя обойтись в офисе',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    timer: 30,
    answer: 'ПАО Публичное акционерное общество',
    answerLink: 'https://www.vtb.ru/about/contacts/',
  },
  {
    id: 6,
    number: 6,
    type: 'list',
    items: ['Банк', 'ВТБ', 'Терминал', 'Карта', 'Валюта'],
    columns: 2,
    description: 'Назовите 3 предмета, без которых нельзя обойтись в офисе',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    timer: 30,
    answer: 'ПАО Публичное акционерное общество',
    answerLink: 'https://www.vtb.ru/about/contacts/',
  },
  {
    id: 7,
    number: 7,
    type: 'audio',
    audio: TaskAudio7,
    description: 'Угадайте звук устройства, которое используется в банке. У вас есть две попытки.',
    fallbackDescription:
      'Угадайте устройство, которое используется в банке, по описанию. Внешнее, периферийное устройство компьютера, предназначенное для вывода текстовой или графической информации, хранящейся в компьютере, на твёрдый физический носитель.',
    subDescription: 'Если выполнили задание:\n' + 'идите вперед на 4 шага',
    answer: 'Принтер',
    answerLink: 'https://www.vtb.ru/about/contacts/',
  },
];
