export const CHARACTERS = [
  {
    id: 1,
    name: 'Иван Инкрисов',
    superpower: 'Готовность к риску. Вы можете вытянуть дополнительную карточку шанс один раз за игру.',
  },
  {
    id: 2,
    name: 'Екатерина Менеджерова',
    superpower: 'Командная работа. Добавляет +2 шага вашей команде при выполнении командного задания.',
  },
  {
    id: 3,
    name: 'Дмитрий Айтишников',
    superpower: 'Корпоративная культура. Позволяет заменить карточку задания.',
  },
  {
    id: 4,
    name: 'Ирина Организаторова',
    superpower: 'Мастер делегирования. Позволяет передать задание любой команде по выбору.',
  },
  {
    id: 5,
    name: 'Александр Стартапов',
    superpower: 'Индивидуалист. Добавляет +2 шага за задание, выполненное одним участником.',
  },
  {
    id: 6,
    name: 'Денис Стабильников',
    superpower: 'Зубрила. Можно обучиться навыку без потери хода.',
  },
];
